Библиотека/src/Documents/ПоступлениеКниг/ПоступлениеКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКниг</name>
  <registerRecords>AccumulationRegister.КнигиВБиблиотеке</registerRecords>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека/src/AccumulationRegisters/КнигиВБиблиотеке/КнигиВБиблиотеке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигиВБиблиотеке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.Операция</types>
    </type>
  </attributes>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоРазмещения</name>
    <type>
      <types>CatalogRef.Абоненты</types>
      <types>CatalogRef.МестаРазмещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Библиотека/src/Enums/Операция/Операция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Операция</name>
  <enumValues>
    <name>ПоступлениеКниг</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаКнигиАбоненту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКнигиАбонентом</name>
  </enumValues>
  <enumValues>
    <name>СписаниеКниг</name>
  </enumValues>
</mdclass:Enum>

Библиотека/src/Documents/ПоступлениеКниг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)		
	ОбщегоНазначения.ПроверитьНаОдинаковыеПозиции(Книги, Отказ);
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаКниги Из Книги Цикл
		// регистр КнигиВБиблиотеке Приход
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаКниги.Книга;		
		Движение.МестоРазмещения = Справочники.МестаРазмещения.Библиотека;
		Движение.Операция =  Перечисления.Операция.ПоступлениеКниг;
		Движение.Количество = 1;
	КонецЦикла;	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
